# 作者：Wei
# 时间 2022/3/17 10:13

#由大地坐标变换空间直角坐标

import math

print("由大地坐标变换空间直角坐标功能")
B,L,H=eval(input("请输入大地坐标,B为大地纬度(以°为单位)，L为大地经度(以°为单位)，H为大地高(以米为单位)，格式：B，L，H："))
f=eval(input("请选择需要依据的椭球，克拉索夫斯基椭球请输入1,1975国际椭球请输入2，WGS84椭球请输入3，CGCS2000椭球请输入4:"))

B=(B*math.pi)/180#角度转弧度
L=(L*math.pi)/180#角度转弧度

if f==1:
    s="克拉索夫斯基椭球"
    a=6378245.0000000000
    b=6356863.0187730473
elif f==2:
    s ="1975国际椭球"
    a =6378140.0000000000
    b =6356755.2881575287
elif f==3:
    s = "WGS84椭球"
    a =6378137.0000000000
    b =6356752.3142451795
elif f==4:
    s="CGCS2000椭球"
    a=6378137.0000000000
    b=6356752.3141403558
else:
    print("您选择的参考椭球有误")

e = math.sqrt((a * a - b * b) / (a * a))
print(e)
N = a / (math.sqrt(1 - e *e*math.sin(B)* math.sin(B)))
print(N)
X = (N + H) * math.cos(B) * math.cos(L)
Y = (N + H) * math.cos(B) * math.sin(L)
Z = (N * (1 - e * e) + H) * math.sin(B)


print("根据{},大地坐标系转换成空间直角坐标系结果为：X={:.3f}，Y={:.3f}，Z={:.3f}".format(s,X,Y,Z))


#B,L,H:41.5,123.5,120.5
